import { Faq } from "@/types/type";

const faqs: Faq[] = [
  {
    question: "ما هي خبرة الشركة في مجال المقاولات؟",
    answer:
      "شركتنا لديها خبرة واسعة في صناعة البناء والإنشاءات. لقد قمنا بتنفيذ مجموعة متنوعة من المشاريع الكبيرة والصغيرة، بما في ذلك المباني السكنية والتجارية والمشاريع البحرية والبنية التحتية. نحن نفخر بإتقاننا في تنفيذ المشاريع وتحقيق رضا العملاء.",
  },
  {
    question: "هل لديكم التراخيص والشهادات اللازمة للعمل في مجال المقاولات؟",
    answer:
      "نعم، شركتنا تمتلك جميع التراخيص والشهادات اللازمة لممارسة أعمال المقاولات. نحن نلتزم بالقوانين واللوائح المحلية والدولية ذات الصلة ونحرص على الامتثال لها في جميع مشاريعنا.",
  },
  {
    question: "ما هو نطاق الخدمات التي تقدمونها؟",
    answer:
      "نحن نقدم مجموعة شاملة من خدمات الإنشاءات، بما في ذلك بناء المباني السكنية والتجارية، والبنية التحتية والطرق، والهياكل الخرسانية والصلبة، وأعمال التشطيبات والتجهيزات، وإدارة المشاريع. نحن نغطي مختلف الجوانب اللازمة لإنجاز المشروعات بنجاح.",
  },
  {
    question: "ما هي مدة التنفيذ المتوقعة للمشاريع؟",
    answer:
      "مدة التنفيذ تعتمد على حجم وتعقيد المشروع. نحن نقوم بتحليل المشروع بدقة ونقدم جدول زمني واقعي للعملاء يشمل مراحل البناء المختلفة. نحرص على احترام المواعيد المحددة وتنفيذ المشاريع في الوقت المناسب.",
  },
  {
    question: "كيف يتم ضمان جودة العمل المقدم؟",
    answer:
      "نحن نضع الجودة في صميم أولوياتنا. نستخدم مواد عالية الجودة ونتبع معايير البناء والإنشاءات المحددة. لدينا فريق مؤهل من المهندسين والفنيين المختصين يقومون بمراقبة الجودة خلال جميع مراحل المشروع. كما نحرص على متابعة ملاحظات العملاء وتلبية متطلباتهم بدقة.",
  },
  {
    question: "هل لديكم أعمال مرجعية سابقة يمكنني الاطلاع عليها؟",
    answer:
      "نعم، لدينا مجموعة واسعة من المشاريع السابقة التي قمنا بتنفيذها ويمكنك الاطلاع عليها. نحن نفخر بما حققناه ونقدم أمثلة على مشاريع مختلفة في صفحات العملاء أو القسم المخصص على موقعنا على الإنترنت.",
  },
];

export default faqs;
