import { servPage } from "@/types/type";

export const servicesPage: servPage[] = [
  {
    id: 1,
    title: "خدمات البناء",
    desc: "تقوم الشركة بتقديم استشارات متخصصة للعملاء في مجال البناء. تساعدهم في وضع خطط متكاملة وتصميمات مبتكرة تلبي احتياجاتهم وتحقق أهدافهم المحددة. تتولى الشركة إدارة جميع جوانب المشروع بالكامل. تنسق الأعمال والجداول الزمنية وتتابع التقدم وتوفر تحكمًا فعالًا في التكاليف والموارد لضمان تنفيذ المشروع بنجاح. تقوم الشركة بتنفيذ عمليات البناء بدقة وجودة عالية. تعتمد على فرق عمل مؤهلة ومهنية وتستخدم مواد بناء عالية الجودة لضمان المتانة والاستدامة.",
    img: "https://res.cloudinary.com/dlaeaq6is/image/upload/v1740573900/s1_yyxes4.png",
  },
  {
    id: 2,
    title: "ادارة البناء",
    desc: "يشمل ذلك مدير المشروع الذي يتولى التخطيط الاستراتيجي وتنسيق العمليات واتخاذ القرارات الحاسمة. بالإضافة إلى ذلك، يوجد فريق إداري يتولى مراقبة التكاليف وإدارة المخاطر والجودة، وكذلك فريق مهندسين وفنيين يقومون بإعداد التصميمات وإشراف على تنفيذ الأعمال وضمان جودتها. تشمل مهام إدارة البناء أيضًا التواصل المستمر مع العملاء والموردين والمقاولين الفرعيين. تسهم هذه الاتصالات في توفير تواصل فعال وفهم واضح لمتطلبات العميل وتوقعاتة",
    img: "https://res.cloudinary.com/dlaeaq6is/image/upload/v1740573901/s2_wfsrme.png",
  },
  {
    id: 3,
    title: "انشاءات عامة",
    desc: "تطلب الانشاءات العامة مهارات متخصصة وخبرة في مجالات متعددة. يتعين على المهندسين المدنيين والمعماريين والفنيين العمل بتنسيق وثقة لتحقيق التصاميم المطلوبة وتنفيذ المشاريع . بشكل صحيح وكل هذا تجده في شركتنا بدءًا من التخطيط والتصميم الهندسي وحتى تنفيذ الأعمال الانشائية الفعلية يقوم مشرفونا بمتابعه العمال جيدا للخروج باكمل وجه للمشروع.",
    img: "https://res.cloudinary.com/dlaeaq6is/image/upload/v1740573900/s3_x6vdpg.png",
  },
  {
    id: 4,
    title: "تصميم البناء",
    desc: "تتضمن خدماتنا تصميم وتخطيط المشاريع، وإدارة المشاريع، وتنفيذ الأعمال الإنشائية، وإدارة الجودة والمراقبة، والصيانة والتشغيل. نحن نعمل على تقديم حلول شاملة لعملائنا، بدءًا من مرحلة التخطيط وحتى التسليم النهائي للمشروع. تتميز شركتنا بالتفاني والتفهم العميق لاحتياجات العملاء. نحن نعمل على تحقيق رؤية العميل وتنفيذ مشاريعهم بدقة وفقًا للمواصفات المطلوبة. نحن نعتبر كل مشروع فرصة لإظهار قدراتنا والتفوق في تقديم الحلول المبتكرة والمستدامة.",
    img: "https://res.cloudinary.com/dlaeaq6is/image/upload/v1740573901/s4_i47g3y.png",
  },
];
