import { servType } from "@/types/type";
import { Building, FileKey2, PencilRuler, Ship } from "lucide-react";

export const services: servType[] = [
  {
    id: 1,
    title: "خدمات البناء",
    desc: "نتولى تنفيذ جميع مراحل البناء والتشييد باتقان ومهارة عالية. من الأساسات والهياكل الخرسانية إلى التركيبات الكهربائية والسباكة، نحرص على تنفيذ كل جزء من المشروع بأعلى معايير الجودة",
    icon: Building,
  },
  {
    id: 2,
    title: "ادارة البناء",
    desc: "شركتنا للمقاولات توفر خدمات ادارة البناء الشاملة، حيث نقوم بتنسيق وإدارة جميع جوانب المشروع للتأكد من تنفيذه بنجاح وفقًا للمواصفات المطلوبة",
    icon: PencilRuler,
  },
  {
    id: 3,
    title: "انشاءات عامة",
    desc: "نحن متخصصون في بناء المباني السكنية والتجارية بمختلف المقاييس والأحجام. سواء كنتم تخططون لبناء فيلا سكنية، مجمع سكني، مبنى تجاري، أو مركز تسوق، فإننا نقوم بتنفيذ جميع مراحل البناء بدءًا من الأساسات وصولاً إلى التشطيبات النهائية",
    icon: FileKey2,
  },
  {
    id: 4,
    title: "انشاءات بحريه",
    desc: "نقوم بتصميم وبناء المرافئ والموانئ بجميع المرافق المطلوبة، بما في ذلك أرصفة الشحن والتفريغ، والأحواض الجافة والرطبة، والأنظمة الأمنية والإضاءة، والمنشآت الإدارية. نحن نلتزم بتنفيذ المشاريع بأعلى معايير الجودة والأمان وفقًا للمعايير البحرية المطلوبة",
    icon: Ship,
  },
];
